MaroshCZ/Power-Supply-USB-C/STM32G0_USBPD_Sink_1.2/Application/app.c
	// Make a copy for tokenization
	char cmd_copy[64] = {0};
	strncpy(cmd_copy, (char*)command, sizeof(cmd_copy)-1);

	// Clear white spaces..
	char cmd_trimmed[64];
	cleanString(cmd_copy, cmd_trimmed, " ");

	// Extract command part (everything up to : )
	char* cmd_part = strtok(cmd_trimmed, ":");
	char* params = NULL; // extracts the part after "numbers"

	// Parameters start after the delimiter
	if (cmd_part != NULL && strlen(cmd_part) < length) {
		params = strtok(NULL, ":");  // Get remaining part after ':'
	}

	// Define command table
	/*
	static const Command_t commands[] = {
		{"*IDN?", idnHandler},
		{"PROFILES", profilesHandler},
		{"VOUT", voutHandler},
		{"IOUT", ioutHandler},
		{"VSET", vsetHandler},
		{"ISET", isetHandler},
		{"OCP", ocpHandler},
		{"OUT", outHandler},
		{NULL, NULL} // Sentinel
	};*/

	//Create buffer for response
	char response[64];

	//Process commands
    if (strcmp(cmd_part, "OCP1") == 0)
    {
    	snprintf(response, sizeof(response), "OCP enabled\r\n");

        sm->OCPMode = OCP_ENABLED;

		//Update AWD limits
		int isense_Vtrip_mV = (dhandle->currentSet *G_SENSE*R_SENSE_MOHMS)/1000; // mV  (mA * mOhms * Gain)
		int isense_rawADCtrip= (isense_Vtrip_mV *4095) / VDDA_APPLI; //value for AWD treshold
		Update_AWD_Thresholds(0, isense_rawADCtrip, ADC_ANALOGWATCHDOG_2);
    }
    else if (strcmp(cmd_part, "OCP0") == 0)
    {
    	snprintf(response, sizeof(response), "OCP disabled\r\n");

        sm->OCPMode = OCP_DISABLED;
		//Update AWD limits
		Update_AWD_Thresholds(0, OCP_DISABLED_HT, ADC_ANALOGWATCHDOG_2);
    }
    else if (strcmp(cmd_part, "VSET1") == 0)
    {
    	sm->rotaryBtnPressed = true;
    	sm->setValueMode = SET_VOLTAGE;

    	uint32_t voltage = atof(params)*100; // Convert float to uint (also V to centivolts)

    	if (dhandle->voltageMin < voltage && voltage < dhandle->voltageMax) {
    	   	dhandle->voltageSet = voltage; //save in centivolts
    		snprintf(response, sizeof(response), "Voltage set to new value: %lu.%02lu V\r\n", dhandle->voltageSet / 100, dhandle->voltageSet % 100);
    	} else {
    		snprintf(response, sizeof(response), "ERROR: Voltage out of bounds\r\n");
    	}
    }
    else if (strcmp(cmd_part, "TIMEOUT1") == 0)
	{
		uint32_t ms = atof(params)*1000; // Convert float to uint milliseconds

		if (0 < ms && ms < 10000) {
			sm->timeoutCounter = ms;
			snprintf(response, sizeof(response), "Timeout set to new value: %lu.%03lu s\r\n", ms / 1000, ms % 1000);
		} else {
			snprintf(response, sizeof(response), "ERROR: Timeout out of bounds (0-10s)\r\n");
		}
	}
    else if (strcmp(cmd_part, "VSET1?") == 0)
	{
		// Convert to volts and format as "XX.XX V"
		snprintf(response, sizeof(response), "Voltage is set to: %lu.%02lu V\r\n", dhandle->voltageSet / 100, dhandle->voltageSet % 100);

		sm->OCPMode = OCP_DISABLED;
		//Update AWD limits
		Update_AWD_Thresholds(0, OCP_DISABLED_HT, ADC_ANALOGWATCHDOG_2);
	}
    else if (strcmp(cmd_part, "ISET1") == 0)
	{
    	sm->rotaryBtnPressed = true;
    	sm->setValueMode = SET_CURRENT;

		uint32_t current = atof(params)*1000; // Convert float parameter to integer

		if (dhandle->currentMin < current && current < dhandle->currentMax) {
			dhandle->currentSet = current; //save in mA
			snprintf(response, sizeof(response), "Current set to new value: %lu.%03lu A\r\n", dhandle->currentSet / 1000, dhandle->currentSet % 1000);
		} else {
			snprintf(response, sizeof(response), "ERROR: Current out of bounds\r\n");
		}

	}
    else if (strcmp(cmd_part, "ISET1?") == 0)
  	{
  		snprintf(response, sizeof(response), "Current is set to: %lu.%03lu A\r\n", dhandle->currentSet / 1000, dhandle->currentSet % 1000);

  		sm->OCPMode = OCP_DISABLED;
  		//Update AWD limits
  		Update_AWD_Thresholds(0, OCP_DISABLED_HT, ADC_ANALOGWATCHDOG_2);
  	}
    else if (strcmp(cmd_part, "OUT0") == 0)
   	{
   		snprintf(response, sizeof(response), "Output disabled\r\n");
   		//Simulate button press
   		if (sm->currentState == STATE_ACTIVE) {
   	   		sm->outputBtnPressed = true;
   		}
   	}
    else if (strcmp(cmd_part, "OUT1") == 0)
	{
		snprintf(response, sizeof(response), "Output enabled\r\n");

		//Simulate button press
		if (sm->currentState == STATE_IDLE) {
			sm->outputBtnPressed = true;
		}
	}
    else if (strcmp(cmd_part, "VOUT1?") == 0)
   	{
   		snprintf(response, sizeof(response), "Measured output voltage: %lu.%02lu V\r\n", dhandle->voltageMeas / 100, dhandle->voltageMeas % 100);
   	}
    else if (strcmp(cmd_part, "IOUT1?") == 0)
   	{
  		snprintf(response, sizeof(response), "Current is set to: %lu.%03lu A\r\n", dhandle->currentMeas / 1000, dhandle->currentMeas % 1000);
   	}
    else if (strcmp(cmd_part, "*IDN?") == 0)
	{
		snprintf(response, sizeof(response), "USB-PD PPS Sink v0.2 (100W,22V,5A)\r\n");
	}
    else if (strcmp(cmd_part, "PROFILES?") == 0)
   	{
    	bool printToCOM = true;
    	sourcecapa_limits(printToCOM);
   	}
    else
    {
        snprintf(response, sizeof(response), "Unknown command\r\n");
    }

    // Send response
    CDC_Transmit_FS((uint8_t*)response, strlen(response));
}

/*
 * Define state Handle functions
 */
void handleInitState(void) {
    // Entry actions (if just entered this state)
    static bool entryDone = false;

    //=======================================================
	// ENTRY ACTIONS - Executed once when entering the state
	//=======================================================
    if (!entryDone) {
    	// Set the state entry time and timeout duration
		sm->stateEntryTime = HAL_GetTick();
		sm->timeoutCounter = 2000;  // 2 seconds timeout

    	//Show SRC limits on displays
        //max7219_PrintIspecial(SEGMENT_2, dhandle->currentSet, 4);
        //max7219_PrintIspecial(SEGMENT_1, dhandle->voltageSet, 3);


        // Save state for return from temporary states
        strcpy(sm->lastStateStr, "INIT");
        sm->lastState = STATE_INIT;

        entryDone = true;
    }

    //==========================================================
	// DO ACTIONS - Executed every time the state is processed
	//==========================================================

    // Check if the timeout has elapsed
    if (HAL_GetTick() - sm->stateEntryTime > sm->timeoutCounter) {
		//After initialization transition to IDLE state
		sm->currentState = STATE_IDLE;
		entryDone = false;
    }

